tutorials/heatTransfer/buoyantSimpleFoam/iglooWithFridges/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 265;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            fixedValue;
        value           uniform 265;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform 303;
    }

    twoFridgeFreezers_herring_1
    {
        $twoFridgeFreezers_seal_0;
    }
}

// ************************************************************************* //
